import { Badge, Box, Text } from "@mantine/core";
import Image from "next/future/image";
import Link from "next/link";

export default function CounsellorCard({ item }: { item: string }) {
  return (
    <Link href={`/counsellors/${item}`} passHref>
      <Box
        data-aos="fade-up"
        data-aos-delay="100"
        data-aos-duration="1000"
        data-aos-offset="50"
        sx={{
          width: "100%",
          borderRadius: "10px",
          boxShadow: "0 0 2px 0px gray",
          // boxShadow: "0 0 5px 0px #4bc9b3",
          display: "flex",
          flexDirection: "row",
          overflow: "hidden",
          cursor: "pointer",
          transition: "ease 250ms",
          // ":hover": {
          //   translate: "-3px -3px",
          // },

          "@media (max-width: 1000px)": {
            flexDirection: "column",
          },

          "@media (max-width: 600px)": {
            flexDirection: "column",
          },
        }}
      >
        <Box
          sx={{
            flexBasis: "35%",
            justifyContent: "center",
            "@media (max-width: 1000px)": {
              display: "flex",
            },
          }}
        >
          <Box
            sx={{
              position: "relative",
              height: "100%",
              minHeight: "200px",
              overflow: "hidden",

              "@media (max-width: 1000px)": {
                width: "200px",
                height: "200px",
                borderRadius: "100%",
                margin: "20px",
              },

              "@media (max-width: 600px)": {
                width: "200px",
                height: "200px",
                borderRadius: "100%",
                margin: "20px",
              },
            }}
          >
            <Image
              alt="Counsellor Photo"
              src={
                "https://images.pexels.com/photos/220453/pexels-photo-220453.jpeg?auto=compress&cs=tinysrgb&w=1600"
              }
              // layout={"fill"}
              style={{ objectFit: "cover" }}
              fill
              priority
            />
          </Box>
        </Box>
        <Box sx={{ flexBasis: "65%", padding: "20px" }}>
          <Text weight={600} size={20} sx={{}}>
            {item}
          </Text>
          <Badge>
            <Text weight={500} color={"#4697fb"}>
              Counsellor
            </Text>
          </Badge>
          <Text
            lineClamp={6}
            size={14}
            sx={{
              marginTop: "20px",
              transition: "ease 250ms",
              lineHeight: "25px",
            }}
          >
            Lorem, ipsum dolor sit amet consectetur adipisicing elit. Labore
            voluptatibus voluptatem officia laudantium est et omnis placeat eius
            ab soluta, asperiores dignissimos inventore voluptate vero nisi
            vitae consequuntur eaque rerum.
            {/* မြန်မာနိုင်ငံ သမိုင်း တစ်လျှောက်တွင် ဖြစ်ပျက်ခဲ့သော နိုင်ငံရေး
            လှုပ်ရှားမှုများကို ဤသို့ မှတ်တမ်း တင်နိုင်ပေသည်။ ဦးစွာ ပထမ
            အာရှတိုက် အလယ်ပိုင်းဒေသမှ မျက်မှောက် မြန်မာနိုင်ငံတည်ရာ ဒေသသို့
            တစ်ရွေ့ရွေ့ ဆင်းသက်လာ ကြသော ပျူ၊ ကမ်းယံ၊ သက်စသော လူမျိုးများသည်
            ဧရာဝတီမြစ်ဝှမ်း ဒေသသို့ ရှေးဦးစွာ ရောက်လာကြကာ မြစ်ကမ်း တစ်လျှောက်၌
            အခြေစိုက် နေထိုင်ခဲ့ကြသည်။ ထိုသူတို့တွင် အချို့က ပင်လယ်ကမ်းခြေသို့
            ဆင်းကြသည်။ ထိုသူတို့သည် မိမိတို့ နေထိုင်ရာ ဒေသအသီးသီးတွင်
            ဆယ်အိမ်တစ်စု၊ ဆဲငါးအိမ်တစ်စု၊ အိမ် ၂ဝ တစ်စု စသည်ဖြင့်
            အိမ်စုများဖွဲ့ကာ အနှံ့အပြား နေထိုင်ကြ သည်။ လူဦးရေတိုးလာသောအခါ
            အိမ်စုများ စုပေါင်း၍ ရွာဖြစ်လာသည်။ ရွာလုံခြုံစေရန် ခြံစည်းရိုး
            ကာခြင်း၊ ရွာတံခါးအနီးတွင် ကင်းတဲ ဆောက်၍ ကင်းစောင့်ခြင်းတို့ကို
            ပြုကြသည်။ ထိုအချိန်၌ မြန်မာနိုင်ငံမြောက်ပိုင်း ဧရာဝတီမြစ်
            အရှေ့ဘက်ကမ်း၌ တကောင်းအမည်ရှိသောပြည်၊ ရခိုင်ဘက်တွင် မြောက်အရပ်၌
            ဝေသာလီအမည်ရှိသော ပြည်၊ တောင်ဘက် ပင်လယ်ကမ်းခြေတွင် ယခုခေတ်
            သထုံမြို့တည်ရာ အရပ်၌ သထုံ အမည်ရှိသောပြည်၊ ယခုခေတ် ပြည်မြို့၏
            အရှေ့ဘက် မှော်ဇာရွာ တည်ရာအရပ်၌ သရေခေတ္တရာ အမည်ရှိသော ပြည်ဟု
            ပြည်လေးပြည် ထွန်းကားလာသည်။ ထို့ပြင် ယခုခေတ် ပဲခူးမြို့တည်ရာ
            အရပ်၌လည်း ဟံသာဝတီ ပဲခူးမြို့ ထွန်းကား လာသည်။ ထိုပြည်ကြီးများသည်
            င်္မိဒေသနှင့်လည်းကောင်း၊ ပမ္ဖဝါတိုင်းနှင့်လည်းကောင်း အဆက်အသွယ်
            ရှိလာလေသည်။ ထိုပြည်ကြီးများ၏ အကြီးအကဲတို့သည် င်္မိဒေသမင်း၊
            ပမ္ဖဝါမင်းတို့၏ ဓလေ့ထုံးစံ အချို့ကို သုံးစွဲလာကြသည်။ င်္မိမ ဒေသမင်း၊
            ပမ္ဖဝါမင်းများသည် သက်ဦးဆံပိုင်သော လောကသမုတိ နတ်ဟူ၍လည်းကောင်း၊
            ရေမြေ့ရှင် ဘဝရှင် ဟူ၍ လည်းကောင်း၊ စကြဝတေးမင်းဟူ၍ လည်းကောင်း
            အခေါ်ခံခဲ့ကြလေသည်။ ဤသို့ဖြင့် မြန်မာနိုင်ငံတွင် ရေမြေ့ရှင်
            သက်ဦးဆံပိုင် ဘုရင်စနစ် ထွန်းကား လာခဲ့လေသည်။ မြန်မာဘုရင်များ
            စိုးမိုးသည့်ခေတ် တစ်လျှောက်လုံး သက်ဦးဆံပိုင် စနစ်ဖြင့်
            အုပ်ချုပ်ခဲ့သည်။ ဘုန်းပညာနှင့် ပြည့်စုံ၍ အမြော်အမြင်ရှိသော
            မင်းများလက်ထက်တွင် နိုင်ငံကြီးကျယ် စည်ကား ဖွံ့ဖြိုးပြီးလျှင်
            ဘုန်းပညာ နည်း၍ အမြော်အမြင် မရှိသော မင်းများ လက်ထက်၌ မြန်မာနိုင်ငံသည်
            ဒုက္ခအမျိုးမျိုးနှင့် ကြုံတွေ့ကာ နိုင်ငံပျက်ရသည့်အခြေသို့
            ရောက်ခဲ့ရသည်။ အနော်ရထာ၊ ဘုရင့်နောင်နှင့် အလောင်းဘုရားမင်းတို့ သည်
            အစိတ်စိတ်ကွဲပြားနေသော မြန်မာနိုင်ငံကို စုစည်းတည် ထောင်သော မင်းများဟု
            သမိုင်းတွင် ထင်ရှားလေသည်။ ကုန်းဘောင်ခေတ်ဟူ၍ အမည်တွင်သော နောက်ဆုံး
            မြန်မာဘုရင်များ ခေတ်တွင် ပေါ်တူဂီ၊ အင်္ဂလိပ်၊ ပြင်သစ်၊ ဒပ်ချစသော
            ဥရောပ တိုက်သားတို့သည် မြန်မာနိုင်ငံတွင် ရှေးဦးစွာ ကုန်ရောင်း
            ကုန်ဝယ်များအဖြစ် ရောက်လာကြ ပြီးသည့်နောက် တဖြည်းဖြည်း နယ်ချဲ့ ဝါဒကို
            ကျင့်သုံးလာကြ သည်။ ယင်းသို့ဖြင့် ၁၈၂၆ ခုနှစ် အင်္ဂလိပ်န္ထမြန်မာ ပထမ
            စစ်ပွဲတွင် မြန်မာတို့က အင်္ဂလိပ်အစိုးရအား အာသံ၊ မဏိပူရ၊ ရခိုင်၊
            တနင်္သာရီနယ်များ ပေးအပ်လိုက်ရခြင်း၊ ၁၈၅၂ ခုနှစ် ဒုတိယစစ်ပွဲတွင်
            အောက်အကြေပိုင်းကို မြေထဲမြို့၊ တောင်ငူမြို့များအထိ
            ပေးလိုက်ရခြင်းတို့ ပေါ်ပေါက်လာသည်။ ထိုအခါ မြန်မာပိုင်
            အထက်မြန်မာနိုင်ငံ၌ မင်းတုန်းမင်းကြီး အုပ်စိုး၍ အင်္ဂလိပ်မင်းပိုင်
            အောက်နိုင်ငံကိုမှု ရခိုင်တိုင်း၊ တနင်္သာဲရီတိုင်း၊ ပဲခူးတိုင်းဟူ၍
            တိုင်းသုံးတိုင်းခွဲပြီးလျှင် တိုင်းမင်းကြီးတစ်ဦးစီ ခန့်၍
            အိန္ဒိယနိုင်ငံ ဘုရင်ခံချုပ်က အုပ်ချုပ်သည်။ ၁၈၆၂ ခုနှစ်တွင်
            တိုင်းသုံးတိုင်းကို စုပေါင်းအုပ်ချုပ်ရန် မဟာဝန်ရှင်တော်မင်းကြီး
            တစ်ဦးကိုခန့်ထားလေသည်။ ပထမ မဟာဝန်ရှင်တော် မင်းကြီး သည် ဆာအာသာ ပါဗီ
            ဖယ်ယာဖြစ်သည်၊၊ ( ဖယ်ယာ၊ ဆာအာသာ။) မဟာဝန်ရှင်တော် မင်းကြီရုံးကို
            ရန်ကုန်မြို့၌ ရုံးစိုက်သဖြင ့် ရန်ကုန်မြို့သည် အင်္ဂလိပ်မင်းပိုင်
            အောက်နိုင်ငံ၏ မြို့တော်ဖြစ်လာလေသည်။ ရန်ကုန်မြို့ကိုလည်း
            ခေတ်မီဆိပ်ကမ်းမြို့ကြီး ဖြစ်စေရန် တိုးချဲ့၍ မြို့သစ်တည်သည်။ (
            ရန်ကုန်မြို့ ။) စီးပွားရေးလုပ်ငန်း မှန်သမျှကို လည်း အင်္ဂလိပ်
            အရင်းရှင်ကြီးများသည် ငွေအရင်းအနှီးနှင့်တကွ ရန်ကုန်မြို့သို့
            ရောက်လာကြသော လက်ဝါးကြီးအုပ်လုပ်ကိုင်ကြ တော့သည်။ မြန်မာပိုင်
            အထက်မြန်မာနိုင်ငံနှင့် အင်္ဂလိပ်ပိုင် အောက်မြန်မာနိုင်ငံတို့သည်
            အကူးအသန်း အဆက်အဆံ မပြတ်ရှိ၍ ရင်းနှီးမြဲရင်းနှီးကြလေသည်။
            နယ်ချဲ့ခွင့်ရတိုင်း နယ်ချဲ့ရန် ကြံစည်နေကြသော
            အင်္ဂလိပ်အစိုးရနှင့်လည်းကောင်း၊ ပြင်သစ် အစိုးရနှင့်လည်း ကောင်း
            သင့်မြတ်အောင် ဆက်ဆံတတ်သော မင်းတုန်းမင်းသည် ၁၈၇၈ ခုနှစ်တွင်လွန်၍
            ထိုနှစ်၌ပင် သားတော် သီပေါမင်း နန်းတက်သည်။ မင်းတုန်းမင်းတွင်
            သားတော်ကြီးများ ဖြစ်ကြသော သုံးဆယ်မင်းသား၊ မက္ခရာမင်းသား၊
            ညောင်ရမ်းမင်းသားတို့ ရှိှလေသည်။ ထိုသားတော်ကြီး သုံးပါသည်
            ခမည်းတော်ရှိသဖြင့် ပြည်တွင်းပြည်ပအရေးတို့၌ လောကအကြားအမြင် အတွေ့
            အကြုံများ၍ ဝါရင့်သူများ ဖြစ်လေသည်။ သို့ရာတွင် ထိုသားတော်ကြီးများကို
            ကျော်ကာ အသက် ၂ဝ ခန့်သာရှိ၍ ဝါနုသေးသော သီပေါမင်းသားကို
            အလယ်နန်းမိဖုရား ဖြစ်သော ဆင်ဖြူမရှင်နှင့် မှူးမတ်အချို့က
            နန်းတင်လိုက်သောအခါ နိုင်ငံအရေး ရှုပ်ထွေးလာလေသည်။ မင်းသား
            မင်းသမီးများသာမက ရှေ့နောက် ထောက်ထား တတ်သော မှူးမတ် အများအပြား
            အသက်ဆုံးကြရသည်။ အချို့လည်း အရာကျကြလေသည်။ မင်းမိဖုရားတို့
            မြေ|ာက်စားထားသော အိမ်တော်ပါ လက်သုံးတော်များ၏ အာဏာပြင်းလာ၍
            လွတ်တော်ရုံးတော်တို့၏ အာဏာညံ့လာလေသည်။ တိုင်းရေးပြည်မှု၌ ကျွမ်းကျင်
            လိမ်မာသော ရွှေပြည်ဝန်ကြီး ဦးဘိုးလှိုင်၊ ရေနံချောင်း ဝန်ကြီး၊
            ခန်းပတ်ဝန်ကြီး စသည်တို့ အရာကျ၍ အရည်အချင်းညံ့သော မှူးမတ်များ
            တွင်ကျယ်လာရာ နိုင်ငံရေး အခြေအနေ ပျက်ပြားလာသည်။ ပြည်ပြ ဆက်ဆံရေး၌လည်း
            မင်းတုန်းမင်း လက်ထက်မှာကဲ့သို့ မဟုတ်ဘဲ မပြေမလည်ရှိရာ နောက်ဆုံး၌
            သီပေါမင်း ပါတော်မူပြီးလျှင် ၁၈၈၆ ခုနှစ် ဇန်နဝါရီလ ၁ ရက်နေ့တွင်
            အင်္ဂလိပ် အစိုးရတို့က အထက်မြန်မာနိုင်ငံကို သိမ်းယူပြီး ဖြစ် ကြောင်း
            ကြေညာခဲ့ရသည်အထိ မြန်မာ တစ်နိုင်ငံလုံး သူ့ကျွန်ဘဝရောက်ခဲ့ရလေသည်။
            အင်္ဂလိပ်မင်းများသည် အထက်အောက် မြန်မာနိုင်ငံတဝန်းလုံးကို ဗင်္ဂလား
            ပြည်နယ်၊ မဒရပ်ပြည်နယ် တို့ကဲ့သို့ အိန္ဒိယပြည်၏ ပြည်နယ်တစ်နယ်အဖြစ်
            အိန္ဒိယပြည် အုပ်ချုပ်ရေး၌ ထည့်သွင်း အုပ်ချုပ်လေသည်။
            အင်္ဂလိပ်မင်းများ၏ အုပ်ချုပ်ရေးသည် မြန်မာဘုရင်များ လက်ထက်က ကဲ့သို့
            သက်ဦးဆံပိုင် အုပ်ချုပ်ရေး မဟုတ်တော့ချေ။ မြန်မာဘုရင်များ လက်ထက်က
            ပြည့်ရှင်မင်းသည် တန်ခိုးအကြီးဆုံး ဖြစ်သော်လည်း အင်္ဂလိပ်မင်းများ၏
            အုပ်ချုပ်ရေးတွင် ဥပဒေသည် တန်ခိုးအကြီး ဆုံးဖြစ်သည်။
            မြန်မာတိုင်းသူပြည်သားများသည် သီပေါမင်း ပါတော်မူပြီးနောက်
            နိုင်ငံခြားသား အင်္ဂလိပ် အစိုးရအုပ်စိုးလာ သည်ကို မကြိုက်နိုင်သဖြင့်
            ဟိုတစ်စု သည်တစ်စု ပုန်ကန်ထကြွ ကြသည်ကို အင်္ဂလိပ်အစိုးရသည် အတန်ကြာ
            လိုက်လံနှိမ်နှင်းရ လေသည်။ */}
          </Text>
        </Box>
      </Box>
    </Link>
  );
}
